Documents/ЛБ_БланкиЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_БланкиЗалоговыхБилетов</Name>
			<Comment>Оприходование бланков залоговых билетов</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_БланкиЗалоговыхБилетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаБланковОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БланкиБилетов</Name>
					<Comment>Бланки билетов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_БланкиЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_БланкиЗалоговыхБилетов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЛБ_БланкиЗалоговыхБилетов/Ext/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА
//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьТаблицуБланковБилетов(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Организация КАК Организация,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Номер КАК Номер,
	               |	СУММА(ЛБ_БланкиЗалоговыхБилетовОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_БланкиЗалоговыхБилетов.Остатки КАК ЛБ_БланкиЗалоговыхБилетовОстатки
	               |ГДЕ
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Номер В(&СписокНомеров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Организация,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Ломбард,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Номер";	
    Запрос.УстановитьПараметр("ДатаДок",Новый Граница(Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СписокНомеров",БланкиБилетов.ВыгрузитьКолонку("Номер"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Отказ = Истина;
		Пока Выборка.Следующий() Цикл
			Сообщить("Бланк с № "+Выборка.Номер+" не может быть оприходован!"+Символы.ПС
			+ "Уже есть в базе: Организация: "+Выборка.Организация+", ломбард: "+Выборка.Ломбард);
		КонецЦикла;	
	КонецЕсли;	

КонецПроцедуры	

Процедура ДвиженияПоРегистрам()
	// регистр ЛБ_БланкиЗалоговыхБилетов Приход
	Для Каждого ТекСтрокаБланкиБилетов Из БланкиБилетов Цикл
		Движение = Движения.ЛБ_БланкиЗалоговыхБилетов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
				Движение.Номер = ТекСтрокаБланкиБилетов.Номер;
		Движение.Количество = ТекСтрокаБланкиБилетов.Количество;
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверитьТаблицуБланковБилетов(Отказ);

	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам();
		
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()
